gavinslim/STM32F4_TIM_PWM_DMA/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Exported functions prototypes ---------------------------------------------*/
//void Error_Handler(void);
void Error_Handler(uint8_t ERROR);

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

// Definition for TIM2 Channel 1
#define TIM2_CHANNEL1_GPIO_CLK_ENABLE    __HAL_RCC_GPIOA_CLK_ENABLE


// Definition for TIM2's DMA
#define TIM2_CC1_DMA_INST                DMA1_Stream5

// Definition for ADCx's NVIC
#define TIM2_DMA_IRQn                    DMA1_Stream5_IRQn
#define TIM2_DMA_IRQHandler              DMA1_Stream5_IRQHandler

/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* Errors */
#define SYSCONF_ERROR1 		0
#define SYSCONF_ERROR2 		1
#define EN_PWM_ERROR 			2
#define TIM_CONFIG_ERROR 	3
#define TIM_INIT_ERROR 		4
#define GPIO_ERROR				5
#define DMA_ERROR					6

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
